دیتا تایپ ها در این زبان کاملا شبیه به دیگر زبان های سطح بالا هست 

-------------------------------------------------------------------------------------------

متغیر ها به این صورت در این زبان تعریف میشوند 
ابتدا کلمه کلید let سپس نام متغیر و بعد از مساوی مقدار متغیر را قرار میدهیم . 
به این صورت : 
let name = "mehran";
نکات کاربردی و مهم در تعریف متغیر در این زبان برنامه نویسی : 
1 - متغیر ها به خودی خود قابلیت تغییر مقدار را ندارند به اصطلاح immutable یا تغییر ناپذیر هستند . پس اگر قصد تغییر مقدار متغیر را در ادامه برنامه دارید از کلمه کلیدی mut که مختصر شده mutable هست بعد از کلمه کلیدی let استفاده کنید 
let mut name = "mehran";
---------------
2 - نوع متغیر ها همان ابتدا مشخص خواهند شد و دیگر هیچ نوع داده دیگری را در خود جای نمیدهند . یعنی اگر قابلیت تغییر مقدار هم داشته باشند به هیچ عنوان نوع داده ای به غیر از نوع داده خود را قبول نمیکنند .  
------------
3 - زبان برنامه نویسی rust خودکار تایپ داده هارا در هنگام کامپایل اعمال میکنم . اما اگر قصد تغییر تایپ داده خود یا اعمال داده به صورت دستی را داشتید به این صورت عمل میکنید : 
let name: &str = "mehran";
let mychar: &str = 'A';
---------









