ساختار های شرطی در زبان برنامه نویسی rust 
در ساختار های شرطی دیگر نیازی به استفاده از پرانتز نیست . به این صورت که ابتدا کلمه کلیدی if و سپس شرط را نوشته و در بدنه شرط نیز کد های مورد نظر را قرار میدهیم برای مثال : 
let age: int = 18
if age > 20 {
print("welcome")
}else {
print("move back");
}
ساختار else if هم در این زبان وجود دارد و کاملا شبیه به ساختار if پیاده سازی شده 
if age == 18 {
print("ok")
}else if age > 18{
print("welcome");
}
اما نوع دیگری از تعریف ساختار های شرطی در این زبان وجود دارد 
به این صورت که در متغیر ها مورد استفاده قرار گرفته . 
let condition = true;
 let number = if condition { 5 } else {6}
برای استفاده از این ساختار نیاز است که دو مقداری که یا از if برگشت داده میشوند و به عنوان مقدار متغیر number قرار میگیرند یا از else باید یک نوع تایپ داشته باشند . برای مثال در اینجا فقط تایپ int یا عدد برگشت داده میشود و به عنوان مقدار متغیر number قرار میگیرد .
